/*
Navicat MySQL Data Transfer

Source Server         : 127.0.0.1
Source Server Version : 50553
Source Host           : 127.0.0.1:3306
Source Database       : test

Target Server Type    : MYSQL
Target Server Version : 50553
File Encoding         : 65001

Date: 2019-08-23 11:10:10
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for movie_info
-- ----------------------------
DROP TABLE IF EXISTS `movie_info`;
CREATE TABLE `movie_info` (
  `id` int(10) unsigned NOT NULL,
  `movie_id` int(11) unsigned NOT NULL COMMENT '电影id',
  `movie_name` varchar(100) DEFAULT NULL COMMENT '电影名称',
  `movie_pic` varchar(200) DEFAULT NULL COMMENT '电影图片',
  `movie_director` varchar(50) DEFAULT NULL COMMENT '电影导演',
  `movie_writer` varchar(50) DEFAULT NULL COMMENT '电影编剧',
  `movie_country` varchar(50) DEFAULT NULL COMMENT '电影产地',
  `movie_language` varchar(50) DEFAULT NULL COMMENT '电影语言',
  `movie_main_character` varchar(50) DEFAULT NULL COMMENT '电影主演',
  `movie_type` varchar(50) DEFAULT NULL COMMENT '电影类型',
  `movie_on_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '电影上映时间',
  `movie_span` varchar(20) DEFAULT NULL COMMENT '电影时长',
  `movie_grade` varchar(5) DEFAULT NULL COMMENT '电影评分',
  `remark` varchar(500) DEFAULT '' COMMENT '备注',
  `create_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '创建时间',
  `modify_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  `status` tinyint(1) DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='电影信息表';

-- ----------------------------
-- Records of movie_info
-- ----------------------------
INSERT INTO `movie_info` VALUES ('1', '0', '狗十三', '', '曹保平', '', '', '', '张雪迎/果靖霖/智一桐/代旭/黄诗佳/曹馨月/聂鑫/周珍/', '剧情/家庭/', '2018-12-07 00:00:00', '120分钟', '8.2', '', '0000-00-00 00:00:00', '2019-08-23 10:58:08', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '中国合伙人', '', '陈可辛', '', '', '', '黄晓明/邓超/佟大为/杜鹃/王真儿/乔治·安东/杨晨/张籽沐/雷昊汶/佟磊/刘天佐/Claire Q', '剧情/', '2013-05-17 00:00:00', '112分钟', '7.6', '', '0000-00-00 00:00:00', '2019-08-23 10:58:23', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '中国合伙人', '', '陈可辛', '', '', '', '黄晓明/邓超/佟大为/杜鹃/王真儿/乔治·安东/杨晨/张籽沐/雷昊汶/佟磊/刘天佐/Claire Q', '剧情/', '2013-05-17 00:00:00', '112分钟', '7.6', '', '0000-00-00 00:00:00', '2019-08-23 10:58:27', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '无问西东', '', '李芳芳', '', '', '', '章子怡/黄晓明/张震/王力宏/陈楚生/铁政/祖峰/米雪/王盛德/韩童生/王鑫/郑铮/章泽天/黄梦莹/', '剧情/爱情/战争/', '2018-01-12 00:00:00', '138分钟', '7.6', '', '0000-00-00 00:00:00', '2019-08-23 10:58:31', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '无问西东', '', '李芳芳', '', '', '', '章子怡/黄晓明/张震/王力宏/陈楚生/铁政/祖峰/米雪/王盛德/韩童生/王鑫/郑铮/章泽天/黄梦莹/', '剧情/爱情/战争/', '2018-01-12 00:00:00', '138分钟', '7.6', '', '0000-00-00 00:00:00', '2019-08-23 10:58:42', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '天才枪手 ฉลาดเกมส์โกง', '', '纳塔吾·彭皮里亚', '', '', '', '茱蒂蒙·琼查容苏因/查侬·散顶腾古/依莎亚·贺苏汪/披纳若·苏潘平佑/塔内·瓦拉库努娄/莎琳雷特·托', '剧情/悬疑/犯罪/', '2017-10-13 00:00:00', '130分钟', '8.2', '', '0000-00-00 00:00:00', '2019-08-23 10:58:46', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '天才枪手 ฉลาดเกมส์โกง', '', '纳塔吾·彭皮里亚', '', '', '', '茱蒂蒙·琼查容苏因/查侬·散顶腾古/依莎亚·贺苏汪/披纳若·苏潘平佑/塔内·瓦拉库努娄/莎琳雷特·托', '剧情/悬疑/犯罪/', '2017-10-13 00:00:00', '130分钟', '8.2', '', '0000-00-00 00:00:00', '2019-08-23 10:58:49', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '芳华', '', '冯小刚', '', '', '', '黄轩/苗苗/钟楚曦/杨采钰/李晓峰/王天辰/王可如/隋源/张仁博/苏岩/张国立/赵立新/', '剧情/历史/战争/', '2017-12-15 00:00:00', '136分钟', '7.6', '', '0000-00-00 00:00:00', '2019-08-23 10:59:02', '1');
INSERT INTO `movie_info` VALUES ('1', '0', '芳华', '', '冯小刚', '', '', '', '黄轩/苗苗/钟楚曦/杨采钰/李晓峰/王天辰/王可如/隋源/张仁博/苏岩/张国立/赵立新/', '剧情/历史/战争/', '2017-12-15 00:00:00', '136分钟', '7.6', '', '0000-00-00 00:00:00', '2019-08-23 10:59:06', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '七月与安生', '', '曾国祥', '', '', '', '周冬雨/马思纯/李程彬/李萍/蔡纲/蒙亭宜/沙全泽/姚欣言/李昊芳/蒋亭轩/', '剧情/爱情/', '2016-09-14 00:00:00', '109分钟', '7.6', '', '0000-00-00 00:00:00', '2019-08-23 11:01:13', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:03:50', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:00', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:04', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:07', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:10', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:14', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:17', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:20', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:24', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:27', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:31', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:34', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:38', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:47', '1');
INSERT INTO `movie_info` VALUES ('0', '0', '测试', '', '测试', '', '', '', '测试', '测试', '0000-00-00 00:00:00', '测试', '测试', '', '0000-00-00 00:00:00', '2019-08-23 11:04:50', '1');
